load-test/k6/results/test-1/2-min-ingestion-20-vus/insert-app_csharp_2.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ./scripts/insert-app.js
        output: dashboard http://127.0.0.1:5665

     scenarios: (100.00%) 1 scenario, 20 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 20 looping VUs for 2m0s (gracefulStop: 30s)


     _csharp_2......................: avg=26.872494 min=3.901  med=23.85   max=240.016  p(90)=44.3108 p(95)=52.7932
     data_received..................: 19 MB 156 kB/s
     data_sent......................: 17 MB 142 kB/s
     http_req_blocked...............: avg=3.95µs    min=1µs    med=3µs     max=2.31ms   p(90)=4µs     p(95)=5µs    
     http_req_connecting............: avg=453ns     min=0s     med=0s      max=1.81ms   p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=27.01ms   min=3.95ms med=23.98ms max=240.08ms p(90)=44.47ms p(95)=53ms   
       { expected_response:true }...: avg=27.01ms   min=3.95ms med=23.98ms max=240.08ms p(90)=44.47ms p(95)=53ms   
     http_req_failed................: 0.00% ✓ 0          ✗ 88057
     http_req_receiving.............: avg=121.74µs  min=18µs   med=48µs    max=65.75ms  p(90)=123µs   p(95)=387µs  
     http_req_sending...............: avg=22.2µs    min=7µs    med=19µs    max=7.91ms   p(90)=30µs    p(95)=38µs   
     http_req_tls_handshaking.......: avg=0s        min=0s     med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=26.87ms   min=3.9ms  med=23.85ms max=240.01ms p(90)=44.31ms p(95)=52.79ms
     http_reqs......................: 88057 733.663013/s
     iteration_duration.............: avg=27.24ms   min=4.15ms med=24.21ms max=240.27ms p(90)=44.72ms p(95)=53.24ms
     iterations.....................: 88057 733.663013/s
     vus............................: 20    min=20       max=20 
     vus_max........................: 20    min=20       max=20 


running (2m00.0s), 00/20 VUs, 88057 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  2m0s